Catalogs/Renault_КонвертацияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_КонвертацияДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешниеМетаданные</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:ExternalDataSourceTableRef.Renault_ПередачаДанныхВСторонниеСистемы.ОбъектыМД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Comment>Правило постобработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПоиска</Name>
					<Comment>Правило постобработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЧтение</Name>
					<Comment>Осуществляет поиск без загрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнешнийРеквизит</Name>
							<Comment>Источник</Comment>
							<Type>
								<v8:Type>cfg:ExternalDataSourceTableRef.Renault_ПередачаДанныхВСторонниеСистемы.РеквизитыМД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Comment>Приемник</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоПоиска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоЧтение</Name>
							<Comment>Осуществляет поиск без загрузки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поиск</Name>
							<Comment>Отмечаются реквизиты по которым осуществляется поиск</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_КонвертацияДанных/Ext/ManagerModule.bsl
Функция ЗаполнитьТЧРеквизиты(ОбъектКонвертация) Экспорт
	СтараяТЧ=ОбъектКонвертация.Реквизиты.Выгрузить();
	ОбъектКонвертация.Реквизиты.Очистить();
	
	МД=Renault_ПередачаДанныхВСторонниеСистемы.МетаданныеИзСтроки(ОбъектКонвертация.Наименование);
	Для Каждого Реквизит Из Renault_ПередачаДанныхВСторонниеСистемы.СтруктураРеквизитовОбъектаМД(ОбъектКонвертация.Наименование) Цикл
		Стр=ОбъектКонвертация.Реквизиты.Добавить();
		СтараяСтрока=СтараяТЧ.Найти(Реквизит.Ключ,"Реквизит");
		Если СтараяСтрока=Неопределено Тогда
			Стр.Реквизит=Реквизит.Ключ;
			Стр.ВнешнийРеквизит=ВнешнийРеквизитНайтиПоНаименованию(ОбъектКонвертация.ВнешниеМетаданные,Стр.Реквизит);
			Стр.Активно=Не(Стр.ВнешнийРеквизит.Пустая() И Стр.Правило.Пустая());
			
			//поиск по измерениям РегистраСведений
			Если Найти(ОбъектКонвертация.Наименование,"РегистрСведений.")>0 Тогда
				Если Стр.Реквизит="Период" И МД.ПериодичностьРегистраСведений<>Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
					Стр.Поиск=Истина	
				Иначе
					Стр.Поиск=МД.Измерения.Найти(Стр.Реквизит)<>Неопределено	
				КонецЕсли;	
			КонецЕсли;
			
		Иначе
			ЗаполнитьЗначенияСвойств(Стр,СтараяСтрока);
		КонецЕсли;
	КонецЦикла;
	Возврат Истина
КонецФункции
Функция ВнешнийРеквизитНайтиПоНаименованию(ВнешниеМетаданные,ИмяРеквизита) Экспорт
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.РеквизитыМД ГДЕ ОбъектМД=&ОбъектМД И Имя=&Имя"); 
	Запрос.УстановитьПараметр("ОбъектМД",ВнешниеМетаданные);
	Запрос.УстановитьПараметр("Имя",ИмяРеквизита);
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка
КонецФункции	
Функция ВнешниеМетаданныеПоНаимеменованию(ИмяМД,БазаДанных) Экспорт
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД ГДЕ БазаДанных=&БазаДанных И Имя=&ИмяМД"); 
	Запрос.УстановитьПараметр("БазаДанных",БазаДанных);
	Запрос.УстановитьПараметр("ИмяМД",ИмяМД);
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка
КонецФункции	

Функция ВыполнитьПроверкуМетаданных(ЭлементКонвертации,МассивНеНайденныхТипов) Экспорт
	ЕстьОшибки=Ложь;
	
	СпПримитивныеТипы=Новый Массив;
	СпПримитивныеТипы.Добавить("Булево");
	СпПримитивныеТипы.Добавить("Дата");
	СпПримитивныеТипы.Добавить("Строка");
	СпПримитивныеТипы.Добавить("Число");
	СпПримитивныеТипы.Добавить("Null");
	Для Каждого МД Из Метаданные.Перечисления Цикл спПримитивныеТипы.Добавить("ПеречислениеСсылка."+МД.Имя) КонецЦикла; //добавим перечисления	
	
	СоставМетаданных=Renault_ПередачаДанныхВСторонниеСистемы.СоставМетаданных();
	
	//полный список реквизитов по МД
	РеквизитыМД=Renault_ПередачаДанныхВСторонниеСистемы.СтруктураРеквизитовОбъектаМД(ЭлементКонвертации.Наименование);
	
	//анализ каждого реквизита
	Для Каждого Стр Из ЭлементКонвертации.Реквизиты Цикл
		Если НЕ Стр.Активно Тогда Продолжить КонецЕсли;
		//Если Стр.ВнешнийРеквизит.Пустая() И Стр.Правило.Пустая() И Стр.ПравилоПоиска.Пустая() Тогда
		//	ЕстьОшибки=Истина;
		//	Сообщить("Не определены правила/внешний реквизит для реквизита <"+Стр.Реквизит+">",СтатусСообщения.Внимание);
		//	Продолжить
		//КонецЕсли;
		
		Если Не РеквизитыМД.Свойство(Стр.Реквизит) Тогда
			ЕстьОшибки=Истина;
			Сообщить("Не найден реквизит <"+Стр.Реквизит+">",СтатусСообщения.Внимание);
			Продолжить
		КонецЕсли;	
		
		//проверка типов реквизита
		Для Каждого Тип Из РеквизитыМД[Стр.Реквизит].Типы() Цикл
			ИмяМДРекв=Renault_ПередачаДанныхВСторонниеСистемы.ТипЗначенияВМетаданныеСтрокой(Тип);
			Если ИмяМДРекв=Неопределено Тогда //примитивные типы
				Если СпПримитивныеТипы.Найти(Строка(Тип))=Неопределено Тогда //внутреннии типы 1С кроме примитивных, например ВидДвижения,... - обязательно наличие правила конвертации Строка->Реквизит1С
					Если Стр.Правило.Пустая() И Стр.ПравилоПоиска.Пустая() Тогда
						//ЕстьОшибки=Истина;
						//Сообщить("Реквизит <"+Стр.Реквизит+"> внутреннего типа данных 1С <"+Тип+">. Необходимо наличие правила конвертиции (Строка->"+Тип+")",СтатусСообщения.Внимание);
						Сообщить("Реквизит <"+Стр.Реквизит+"> внутреннего типа данных 1С <"+Тип+">. Возможно необходимо наличие правила конвертиции (Строка->"+Тип+")",СтатусСообщения.Информация);
						Продолжить
					КонецЕсли;	
				КонецЕсли;	
			Иначе //объектные типы - проверить существование
				Если ИмяМДРекв=ЭлементКонвертации.Наименование Тогда Продолжить КонецЕсли; //ссылку на себя не проверяем
				Если Найти(ИмяМДРекв,"Перечисление.")>0 Тогда
					Если Стр.Правило.Пустая() И Стр.ПравилоПоиска.Пустая() Тогда 
						ЕстьОшибки=Истина;
						Сообщить("Для реквизита <"+Стр.Реквизит+"> типа <"+ИмяМДРекв+"> необходимо правило конвертации (Строка->"+ИмяМДРекв+")",СтатусСообщения.Внимание);
					КонецЕсли;
					Продолжить
				КонецЕсли; //перечисления не проверяем
				Запрос=Новый Запрос("Выбрать 1 Из Справочник.Renault_КонвертацияДанных ГДЕ Наименование=&Имя И Активно");
				Запрос.УстановитьПараметр("Имя",ИмяМДРекв);
				Если Запрос.Выполнить().Пустой() Тогда
					Если МассивНеНайденныхТипов.Найти(ИмяМДРекв)=Неопределено Тогда МассивНеНайденныхТипов.Добавить(ИмяМДРекв) КонецЕсли; //общий список не найденных
					ЕстьОшибки=Истина;
					Сообщить("Не найдено описание конвертации реквизита <"+Стр.Реквизит+"> типа <"+ИмяМДРекв+">",СтатусСообщения.Внимание);
					Продолжить
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЦикла;	
	
	Возврат Не ЕстьОшибки
КонецФункции	

&НаКлиенте
Функция ВыполнитьПроверку(ЭлементКонвертации) Экспорт 
	МассивНеНайденныхТипов=Новый Массив;
	Если ВыполнитьПроверкуМетаданных(ЭлементКонвертации,МассивНеНайденныхТипов) Тогда 
		Сообщить("Проверка выполнена успешно",СтатусСообщения.Информация);
		Возврат Истина
	ИначеЕсли МассивНеНайденныхТипов.Количество()>0 Тогда
		Если Вопрос("Создать ссылки не найденных объектов метаданных?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
			Возврат СоздатьСсылкиОбъектовМетаданных(МассивНеНайденныхТипов,ЭлементКонвертации.ВнешниеМетаданные.БазаДанных)
		КонецЕсли;	
	КонецЕсли;
КонецФункции

Функция СоздатьСсылкиОбъектовМетаданных(МассивИменМД,БазаДанных)
	ЕстьОшибка=Ложь;
	//Сп=Новый СписокЗначений;
	//Сп.Добавить("кнЗаписатьТолькоСсылки","Только ссылки");
	//Сп.Добавить("кнЗаписатьПредопределенныеРеквизиты","Предопределенные реквизиты");
	//Сп.Добавить("кнЗаписатьРеквизитыМД","Реквизиты метаданных");
	//Сп.Добавить("кнЗаписатьРеквизитыМДИПредопределенные","Реквизиты метаданных и предопределенные");
	//ИмяКоманды=Сп.ВыбратьЭлемент("Укажите способ создания","кнЗаписатьТолькоСсылки");
	Для Каждого ИмяМД Из МассивИменМД Цикл
		Если Не ТипЗнч( СоздатьМД(ИмяМД,БазаДанных) )=Тип("СправочникСсылка.Renault_КонвертацияДанных") Тогда
			ЕстьОшибка=Истина;
		КонецЕсли;	
	КонецЦикла;
	Возврат Не ЕстьОшибка
КонецФункции

Функция СоздатьМД(ИмяМД,БазаДанных,Родитель=Неопределено) Экспорт
	Ссылка=МДСуществует(ИмяМД,Истина); Если ЗначениеЗаполнено(Ссылка) Тогда Возврат Ссылка КонецЕсли; //поиск
	//создание
	Объект=Справочники.Renault_КонвертацияДанных.СоздатьЭлемент();
	Объект.Активно=Истина;
	Если Родитель<>Неопределено Тогда Объект.Родитель=Родитель КонецЕсли;
	Объект.Наименование=ИмяМД;
	Объект.ВнешниеМетаданные=ВнешниеМетаданныеПоНаимеменованию(ИмяМД,БазаДанных);
	
	ТекстОшибки="";
	//Если НЕ ЗаполнитьРеквизитыОбъекта(Объект.Ссылка,ТекстОшибки,ИмяКоманды) Тогда Сообщить(ТекстОшибки,СтатусСообщения.Внимание) КонецЕсли;
	ЗаполнитьТЧРеквизиты(Объект);
	
	Объект.Записать();
	Возврат Объект.Ссылка
КонецФункции
Функция МДСуществует(ИмяМД,ВернутьСсылку=Ложь) Экспорт
	Запрос=Новый Запрос("Выбрать Ссылка Из Справочник.Renault_КонвертацияДанных ГДЕ Наименование=&ИмяМД");
	Запрос.УстановитьПараметр("ИмяМД",ИмяМД);
	Если ВернутьСсылку Тогда
		Выборка=Запрос.Выполнить().Выбрать();	
		Выборка.Следующий();
		Возврат Выборка.Ссылка
	Иначе Возврат НЕ Запрос.Выполнить().Пустой() КонецЕсли;
КонецФункции
